מספר תיקונים שצריך לעשות במערכת:

בעמוד היררכיה והתמחויות:
לאפשר עריכה של מסגרת לאחר שנוצרה- גם שינוי שם סוג ומסגרת אב
במידה ומבצעים מחיקה של מסגרת אב ויש מסגרות משנה מקבלים שגיאת עמוד- עדיפות להקפיץ חלון התראה שמחיקה תמחוק גם את המסגרות משנה

עמוד תכניות קריירה:
אפשרות לעריכה אירוע נקודתי/מצטבר/כרוני שנוצר כבר
באירועים כרוניים - כל אירוע חדש שנוסף יהיה עם צבע שונה בשביל שנוכל להבדיל בינהם
באירועים מצטברים - כל כרטייסיה של אירוע מקבלת צבע שונה- בחר צבעים רכים שיהיו נעימים לקריאה

סכימת כרטיס עובד:
הפרדה בין שם פרטי לשם משפחה
הוספת תאריך לידה חובה וקבוע
הוספת גיל שימולא אוטמטית כנגזרת מתאריך הלידה- יוצג בשנה וחודשים. גם הוא הוא קבוע


הוספת קבצים:
בכל מקום שיש אפשרות להוסיף קבצים בשיטת dropfile
כאשר העלתי קבצים ולאחר כמה זמן הפוד התרסט- התמונה לא הוצגו וזה נראה כאילו הקובץ לא נמצא. אם זה התמונות נשמרות בכתובת פרטיסטטנית אז אנחנו נדרשים להגדיר בenv את ה path של התיקייה ולא כמו שזה עכשיו בדוקר

קריאה מקבצים- 
כאשר העלתי קובץ pdf בדף לעריכת איש  ולחצתי על נתח מסמך קיבלתי הודעת שגיאה של הניתוח נכשל:
API ERROR 400 LITELLM BAD REQUEST: MOONSHOTEXPETETION FALIED LOAD IMAGE: CANOT INDETIFY IMAGE FALIED
אני מזכיר כי אני רץ עם מודל אחר בעזר הסביבה של קלאוד אך  שהוא לא מולטי מודלי ולכן ברגע שצריך לפענח מה כתוב מתוך קובץ נדרש להריץ מאחורי הקלעים סקריפט שמזהה את סוג הקובץ ומטפל בו בהתרם ומחלץ את הטקסט ולאחר מכן להפעיל את המודל

כאשר שאלתי שאלה לגבי קובץ אקסל שהעלתי לחווד של איש מסוים קיבלתי תשובה:
״כדי לקרוא את תוכן הקובץ אקסל המצורף נדרשת הרשאה להריץ סקריפט של פייתון. האם תאשר לי?״
צריך לוודא כי גם פה יש הרשאות מראש למודל לעשות פעולות וגם פה צריך להיות סקריפט מותאם לקובץ שמחלץ את המידע ראשונית למודל


דשבורדֿ:
תהיה אפשרות לכווץ תת מסגר 
יהיה כפתור של כיווץ כל תתי מסגרות הצוותים בגלל שתחתם יהיו העובדים

דף אנשים:
בכרטייסית איש כאשר לוחצים על התמונה- התמונה תפתח בחלון צף במרכז התמונה ביחס יותר גדול
